       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB17.
      ****************************************
      * AREA DE COMENTÁRIOS - REMARKS
      * AUTHOR = NATALIA WAZNY
      * OBJETIVO = RECEBER E IMPRIMIR A DATA DO SISTEMA
      * UTILIZAR VARIAVEL TIPO TABELA - OCCURS - REDEFINES
      * DATA = XX/XX/XXXX
      ****************************************
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WRK-MESES-EXTENSO.
           02 FILLER PIC X(03) VALUE 'JAN'.
           02 FILLER PIC X(03) VALUE 'FEV'.
           02 FILLER PIC X(03) VALUE 'MAR'.
           02 FILLER PIC X(03) VALUE 'ABR'.
           02 FILLER PIC X(03) VALUE 'MAI'.
           02 FILLER PIC X(03) VALUE 'JUN'.
           02 FILLER PIC X(03) VALUE 'JUL'.
           02 FILLER PIC X(03) VALUE 'AGO'.
           02 FILLER PIC X(03) VALUE 'SET'.
           02 FILLER PIC X(03) VALUE 'OUT'.
           02 FILLER PIC X(03) VALUE 'NOV'.
           02 FILLER PIC X(03) VALUE 'DEZ'.
       01 WRK-MESES REDEFINES WRK-MESES-EXTENSO.
           02 WRK-MES PIC X(03) OCCURS 12 TIMES.
       01 WRK-DATA.
           02 ANO PIC 9(04) VALUE ZEROS.
           02 MES PIC 9(02) VALUE ZEROS.
           02 DIA PIC 9(02) VALUE ZEROS.

       PROCEDURE DIVISION.
       0001-PRINCIPAL.
           PERFORM 0100-INICIALIZAR.
               ACCEPT WRK-DATA FROM DATE YYYYMMDD.
           PERFORM 0200-PROCESSAR
               DISPLAY 'DATA ' DIA ' DE ' WRK-MES(MES) ' DE ' ANO.
           PERFORM 0300-FINALIZAR.
           STOP RUN.
       0100-INICIALIZAR.
       0200-PROCESSAR.
       0300-FINALIZAR.
           DISPLAY 'FINAL DE PROCESSAMENTO'.
